# Отчёт по лабораторной работе №2 по курсу “Фундаментальная информатика”

<b>Студент группы:</b> <ins>М80-108Б-22 Кочкожаров Иван Вячеславович, № по списку 25</ins> 

<b>Контакты e-mail:</b> <ins>tegusigaalpa@gmail.com</ins>

<b>Работа выполнена:</b> «9» <ins> марта </ins> <ins>2023</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> ? </ins>

<b>Отчет сдан</b> «11» <ins>марта</ins> <ins>2023</ins> г., <b>итоговая оценка</b> <ins> ? </ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Стандартные утилиты UNIX для обработки файлов
## 2. Цель работы
Изучение и освоение стандартных утилит UNIX, измения их поведения с помощью ключей, а так же конвеера. Приобретение навыков, необходимых для выполнения курсовых и лабораторных работ в среде UNIX.
## 3. Задание 
Изучение утилит UNIX.
## 4. Оборудование:
<b>Процессор:</b> AMD Ryzen 5 5600H (12) @ 3.300GHz 

<b>ОП:</b> 16gb

<b>SSD:</b> 512 Gb SSD

<b>Монитор:</b> 15.6" - 1920*1080

<b>Графика:</b> Radeon RX Vega 7

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> Gentoo Linux x86_64

<b>Интерпретатор команд:</b> bash версия 5.1.16

<b>Система программирования:</b> -

<b>Редактор текстов:</b> Visual Studio Code версия 1.76.0

<b>Утилиты операционной системы:</b> tar, find, df / wc, dd, grep, tail, tee, head, touch, du, file, gzip, bzip2, tr, cmp, comm, xargs, diff, patch, uniq, sort, cut

## 6. Идея, метод, алгоритм решения:
Для достижения поставленной цели используем утилиту man. Если man-страница будет не понятна, то ищем информацию в Википедии.

## 7. Сценарий выполнения работы:
### Используемые команды для:

    tar
_работа с архивами_

    find
_поиск файлов по имени и другим свойствам_

    df
_показывает список всех файловых систем по именам устройств, сообщает их размер, занятое и свободное пространство и точки монтирования_

    wc 
_вывод числа переводов строк, слов и байт для каждого указанного файла _

    dd
_копирование и конвертация файлов_

    grep
_находит на вводе строки, отвечающие заданному регулярному выражению, и выводит их_

    tail
_вывод нескольких последних строк из файла_

    tee
_выводит на экран, или же перенаправляет выходной поток  (stdout) команды и копирует его содержимое в файл или в переменную_
    
    head
_вывод первых n строк из файла_

    touch
_установка времени последнего изменения файла, также используется для создания пустых файлов_

    du
_оценка занимаемого файлового пространства_

    file
_определения типа файла_

    gzip
_утилита сжатия и восстановления файлов, использующая алгоритм Deflate_

    bzip2
_утилита сжатия и восстановления файлов, использующая алгоритм Барроуза-Уиллера_

    tr
_копирует стандартный входной поток в стандартный выходной, подставляя или удаляя некоторые символы_

    cmp
_сравнивает два файла и, если они различаются, сообщает о первом байте и строке, где было обнаружено различие_

    comm
_читает файл1 и файл2, которые должны быть предварительно лексически отсортированы, и генерирует вывод, состоящий из трёх колонок текста: строки, найденные только в файле файл1; строки, найденные только в файле файл2; и строки, общие для обоих файлов_

    xargs
_берет данные из стандартного ввода или из файла, разбивает их в соответствии с указанными параметрами, а затем передает другой программе в качестве аргумента_

    diff
_сравнение файлов, выводящая разницу между двумя файлами (т.н. patch-файл)_

    patch
_переноса правок (изменений) между разными версиями текстовых файлов, информация о правке обычно содержится в отдельном patch-файле_

    uniq
_ывести или отфильтровать повторяющиеся строки в отсортированном файле_

    sort
_вывод сортированного слияния указанных файлов на стандартный вывод_

    cut
_выборка отдельных полей из строк файла (табуляция разделитель по умолчанию)_

## 8.Пример работы команд:

### tar

Начальная иерархия 
```
ivan@asus-vivobook ~/tests $ tree
.
├── mydir
│   └── file_in_mydir
└── myfile

1 directory, 2 files

```

Создадим архив из файлов (в т.ч. и папок) без сжатия. -c, --create — создать архив; -f, --file — указать имя архива; -v, --verbose — выводить список обработанных файлов.
```
ivan@asus-vivobook ~/tests $ tar -cvf archive.tar mydir myfile
mydir/
mydir/file_in_mydir
myfile
ivan@asus-vivobook ~/tests $ ls
archive.tar  mydir  myfile
```
Создадим новый файл и добавим его к архиву. -r, --append — добавить файлы в конец существующего архива.
```
ivan@asus-vivobook ~/tests $ touch newfile
ivan@asus-vivobook ~/tests $ tar -rf archive.tar newfile
```
Просмотрим содержимое архива. -t, --list — просмотреть содержимое архива. (прим.: порядок ключей имеет значение!)
```
ivan@asus-vivobook ~/tests $ tar -tvf archive.tar
drwxr-xr-x ivan/ivan         0 2023-03-10 02:34 mydir/
-rw-r--r-- ivan/ivan         0 2023-03-10 02:34 mydir/file_in_mydir
-rw-r--r-- ivan/ivan         0 2023-03-10 02:34 myfile
-rw-r--r-- ivan/ivan         0 2023-03-10 02:45 newfile
```
Извлечем сожержимое архива в новую папку. -C — указание каталога.
```
ivan@asus-vivobook ~/tests $ tar -xvf archive.tar -C
archive.tar  mydir/       myfile       newdir/      newfile
ivan@asus-vivobook ~/tests $ tar -xvf archive.tar -C newdir/
mydir/
mydir/file_in_mydir
myfile
newfile
ivan@asus-vivobook ~/tests $ tree newdir/
newdir/
├── mydir
│   └── file_in_mydir
├── myfile
└── newfile

1 directory, 3 files
```

Создадим архив archive.tar.gz из файлов myfile и newfile и каталога mydir и сожмём его с помощью gzip. Сравним размеры архивов с одинаковым содержанием. -a, --auto-compress — дополнительно сжать архив с компрессором который автоматически определить по расширению архива. Если имя архива заканчивается на *.tar.gz то с помощью GZip, если *.tar.xz то с помощью XZ, *.tar.zst для Zstandard и.т.п;

```
ivan@asus-vivobook ~/tests $ tar -cavf archive.tar.gz mydir/ myfile newfile
mydir/
mydir/file_in_mydir
myfile
newfile
ivan@asus-vivobook ~/tests $ du -h archive.tar.gz
4.0K	archive.tar.gz
ivan@asus-vivobook ~/tests $ du -h archive.tar
12K	archive.tar
```


## 9. Дневник отладки 

| №      |  Лаб. или дом. | Дата     | Время  | Событие                        | Действие по исправлению | Примечание |
| ------ | ------         | ------   | ------ | ------                         | ------                  | ------     |
| 1      |  дом.          | 10.03.22 | 2:00   | Выполнение лабораторной работы | -                       | -          |

## 10.Вывод работы:

Изучив основные команды, я научился более эффективно и уверенно пользоваться UNIX-подобной операционной системой.